# -*- coding: utf-8 -*-


# 配置信息

# 扫荡地点集合
wipe_out_location_dict = {
    "manor_6": [(202, 1437), (202, 1437)],
    "manor_5": [(203, 1438), (202, 1444), (198, 1443), (197, 1441)]
}

# 武将出征条件兵力阈值
wipe_out_threshold_dict = [(19000, 6000),
                           (24000, 8000),
                           (22000, 8000),
                           (30000, 9000),
                           (30000, 10000)]

# 需要练级的武将
leveling_hero_dict = [('刘备', '5星', '步', '蜀'),
                      ('董卓', '5星', '步', '汉'),
                      ('庞统', '5星', '步', '蜀'),
                      ('诸葛亮', '5星', '步', '蜀'),
                      ('徐庶', '4星', '骑', '蜀')]

# 撞地帮助武将
help_hero = ('朱儁', '4星', '弓', '汉')

# 撞地土地
leveling_land_help = (1082, 1378)

# 撞地土地
leveling_land = (1082, 1376)
