# -*- coding: utf-8 -*-


# 配置信息（目标实现全自动化识别，人工辅助纠正）


army_count = 5

# 需要练级的武将
leveling_hero_dict = [('刘备', '5星', '步', '蜀'),
                      ('董卓', '5星', '步', '汉'),
                      ('庞统', '5星', '步', '蜀'),
                      ('诸葛亮', '5星', '步', '蜀'),
                      ('徐庶', '4星', '骑', '蜀')]

# 撞地帮助武将
help_hero = ('朱儁', '4星', '弓', '汉')

# 撞地土地
leveling_land_help = (1082, 1378)

# 撞地土地
leveling_land = (1082, 1376)

# 武将出征条件兵力阈值6-5-4-3-2-1
wipe_out_threshold_dict = [(19000, 6000, 0, 0, 0, 0),
                           (24000, 80000, 0, 0, 0, 0),
                           (22000, 80000, 0, 0, 0, 0),
                           (30000, 90000, 0, 0, 0, 0),
                           (30000, 100000, 0, 0, 0, 0)]

# 扫荡地点集合
wipe_out_location_dict = {}

# 主城坐标
main_city_location = (0, 0)
