# -*- coding: utf-8 -*-


# 配置信息

# 扫荡地点集合
wipe_out_location_dict = {
    "manor_6": [(202, 1437), (202, 1437)],
    "manor_5": [(203, 1438), (202, 1444), (198, 1443), (197, 1441)]
}

# 武将出征条件兵力阈值
wipe_out_threshold_dict = [(20000, 6000),
                           (24000, 8000),
                           (22000, 8000),
                           (30000, 9000),
                           (30000, 10000)]

# 需要练级的武将
leveling_hero_dict = [('何进', '3星', '骑', '汉'),
                      ('黄祖', '3星', '弓', '汉'),
                      ('王烈', '3星', '步', '汉'),
                      ('王烈', '3星', '步', '汉'),
                      ('陈到', '3星', '步', '蜀'),
                      ('祢衡', '3星', '步', '群')]

# 撞地帮助武将
help_hero = ('军士', '1星', '弓', '蜀')

# 撞地土地
leveling_land_help = (141, 1301)

# 撞地土地
leveling_land = (144, 1303)
